microchip-pic-avr-solutions/mchv3-dspic33ck64mc105-pfc/hal/pwm.c
    /* PWM GENERATOR 4 Current Limit PCI REGISTER LOW */
    PG4CLPCIL    = 0x0000;
    /* PWM GENERATOR 4 Current Limit PCI REGISTER HIGH */
    PG4CLPCIH    = 0x0000;
    /* PWM GENERATOR 4 Feed Forward PCI REGISTER LOW */
    PG4FFPCIL    = 0x0000;
    /* PWM GENERATOR 4 Feed Forward  PCI REGISTER HIGH */
    PG4FFPCIH    = 0x0000;
    /* PWM GENERATOR 4 Sync PCI REGISTER LOW */
    PG4SPCIL     = 0x0000;
    /* PWM GENERATOR 4 Sync PCI REGISTER LOW */
    PG4SPCIH     = 0x0000;
    
    /* Initialize PWM GENERATOR 4 LEADING-EDGE BLANKING REGISTER LOW */
    PG4LEBL      = 0x0000;
    /* Initialize PWM GENERATOR 4 LEADING-EDGE BLANKING REGISTER HIGH*/
    PG4LEBH      = 0x0000;
    
    /* Initialize PWM GENERATOR 4 PHASE REGISTER */
    PG4PHASE     = 0x0000;
    /* Initialize PWM GENERATOR 4 DUTY CYCLE REGISTER */
    PG4DC        = MIN_DUTY;
    /* Initialize PWM GENERATOR 4 DUTY CYCLE ADJUSTMENT REGISTER */
    PG4DCA       = 0x0000;
    /* Initialize PWM GENERATOR 4 PERIOD REGISTER */
    PG4PER       = 0x0000;
    /* Initialize PWM GENERATOR 4 DEAD-TIME REGISTER LOW */
    PG4DTL       = 0x0000;
    /* Initialize PWM GENERATOR 4 DEAD-TIME REGISTER HIGH */
    PG4DTH       = 0x0000;

    /* Initialize PWM GENERATOR 4 TRIGGER A REGISTER */
    PG4TRIGA     = PFC_LOOPTIME_TCY-100;
    /* Initialize PWM GENERATOR 4 TRIGGER B REGISTER */
    PG4TRIGB     = 0x0000;
    /* Initialize PWM GENERATOR 4 TRIGGER C REGISTER */
    PG4TRIGC     = PFC_Sync_MC_Value;
}
